<head><meta charset="utf-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><title>&#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430; &#x438;&#x437; &#x43B;&#x44E;&#x431;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430;</title><meta name="description" content=""><meta name="HandheldFriendly" content="True"><meta name="viewport" content="width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no"><meta name="google-site-verification" content="FEe4nBxnLwpk7K-xg-_HTuqPkDwk5-IrSRPOnZcmnWw"><link rel="shortcut icon" href="../assets/favicon.png?v=da00f494b1"><link rel="stylesheet" href="../bundle-1012.css"><link rel="alternate" type="application/rss+xml" title="Grishy.ru" href="../rss/index.html"></head><body><header id="header" class="light normal"><div class="container"><h2 class="logo"><a href="../" title="Grishy.ru">Grishy.ru</a></h2><p>&#x411;&#x43B;&#x43E;&#x433; &#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438;</p><div class="primary-menu"><div class="logo-fixed"><a href="../" title="Grishy.ru">Grishy.ru</a></div><ul id="primary-menu" class="menu"><li role="presentation"><a href="../">&#x413;&#x43B;&#x430;&#x432;&#x43D;&#x430;&#x44F;</a></li> <li role="presentation"><a href="../projects/">&#x41F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B;</a></li> <li role="presentation"><a href="../about/">&#x41E; &#x441;&#x430;&#x439;&#x442;&#x435;</a></li></ul></div><div class="social-profiles"><a href="http://vk.com/unbiby" target="_blank"><i class="fa fa-vk"></i></a> <a href="http://www.youtube.com/channel/UCs-BYKmVPdBPCXOC0LFZfCg" target="_blank"><i class="fa fa-youtube"></i></a> <a href="https://twitter.com/unbiby" target="_blank"><i class="fa fa-twitter"></i></a> <a href="mailto:mail@grishy.ru" target="_blank"><i class="fa fa-envelope-o"></i></a> <a href="../rss/index.rss" target="_blank"><i class="fa fa-rss"></i></a></div><a href="index.html#" class="menu-mobile-open"><i class="fa fa-bars"></i></a></div></header><div id="menu-mobile" style="display:none"><div class="inner"><a href="index.html#" class="menu-mobile-close"><i class="fa fa-close"></i></a><ul id="mobile-menu" class="menu"> <li role="presentation"><a href="../">&#x413;&#x43B;&#x430;&#x432;&#x43D;&#x430;&#x44F;</a></li> <li role="presentation"><a href="../projects/">&#x41F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B;</a></li> <li role="presentation"><a href="../about/">&#x41E; &#x441;&#x430;&#x439;&#x442;&#x435;</a></li></ul></div></div><div id="page-content"><div class="container"><div class="row"><div class="col-md-12"><article class="post"><div class="featured-image"><a href="index.html"><img src="../content/images/2015/08/wget.jpg" rel="image_src" alt="&#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430; &#x438;&#x437; &#x43B;&#x44E;&#x431;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430;"></a></div><div class="post-content"><h2 class="post-title"><a href="index.html">&#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430; &#x438;&#x437; &#x43B;&#x44E;&#x431;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430;</a></h2><time class="post-date" datetime="2015-08-19"><i class="fa fa-clock-o"></i>19 &#x430;&#x432;&#x433;&#x443;&#x441;&#x442;&#x430; 2015 &#x433;.</time><div class="post-text"><p>&#x421;&#x435;&#x439;&#x447;&#x430;&#x441; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x43C; &#x43A;&#x430;&#x43A; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x443;&#x44E;(&#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E;) &#x43A;&#x43E;&#x43F;&#x438;&#x44E; &#x441;&#x430;&#x439;&#x442;&#x430;, &#x435;&#x441;&#x43B;&#x438; &#x443; &#x43D;&#x435;&#x433;&#x43E; &#x43D;&#x435;&#x442; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x432; CMS &#x438; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x43D;&#x430; <a href="https://pages.github.com/">GitHub Pages</a>. &#x41A; &#x441;&#x43B;&#x43E;&#x432;&#x443;, &#x435;&#x441;&#x43B;&#x438; &#x43D;&#x443;&#x436;&#x435;&#x43D; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x441;&#x430;&#x439;&#x442;, &#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x43F;&#x440;&#x43E;&#x431;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x432; GitHub <a href="https://github.com/jekyll/jekyll">Jekyll</a> &#x438; &#x435;&#x441;&#x43B;&#x438; &#x443; &#x432;&#x430;&#x441; &#x431;&#x43B;&#x43E;&#x433; &#x438; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x43D;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x430;&#x441;&#x44C; &#x438;&#x434;&#x435;&#x44F; Jekyll, &#x43F;&#x43E;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x439;&#x442;&#x435; <a href="http://octopress.org/">Octopress</a>. &#x42F; &#x442;&#x430;&#x43A; &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x44E; &#x44D;&#x442;&#x43E;&#x442; &#x431;&#x43B;&#x43E;&#x433; &#x43D;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x449;&#x438;&#x439; &#x43D;&#x430; Ghost.</p><p>&#x41B;&#x435;&#x433;&#x447;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x43A;&#x430;&#x447;&#x430;&#x432; &#x432;&#x441;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x431;&#x43B;&#x43E;&#x433; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;. &#x413;&#x440;&#x443;&#x431;&#x43E; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x44F; &#x437;&#x430;&#x439;&#x434;&#x44F; &#x43D;&#x430; &#x432;&#x441;&#x435; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; &#x441;&#x430;&#x439;&#x442;&#x430; &#x438; &#x43D;&#x430;&#x436;&#x430;&#x442;&#x44C; <code>Ctrl+S</code>. &#x41F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x44B; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x439; &#x432; Linux &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x43E;&#x439; <a href="https://ru.wikipedia.org/wiki/Wget">wget</a> &#x438; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x441;&#x435; &#x44D;&#x442;&#x43E; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x439;. &#x414;&#x43B;&#x44F; Ghost &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; <a href="https://github.com/axitkhurana/buster">buster</a>.</p><h3 id="wget">&#x427;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x435; wget?</h3><p><a href="https://ru.wikipedia.org/wiki/Wget"><strong>Wget</strong></a> &#x2014; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x43D;&#x430;&#x44F; &#x43D;&#x435;&#x438;&#x43D;&#x442;&#x435;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x430;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432; &#x43F;&#x43E; &#x441;&#x435;&#x442;&#x438;. &#x41F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x43A;&#x43E;&#x43B;&#x44B; <em>HTTP</em>, <em>FTP</em> &#x438; <em>HTTPS</em>, &#x430; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x443; &#x447;&#x435;&#x440;&#x435;&#x437; <em>HTTP</em> &#x43F;&#x440;&#x43E;&#x43A;&#x441;&#x438;-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440;. &#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x432;&#x43E; &#x432;&#x441;&#x435; &#x434;&#x438;&#x441;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x438;&#x432;&#x44B; <em>GNU/Linux</em>. <em>Wikipedia</em></p><p>Wget &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x43E;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x43A;&#x430;&#x447;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432; &#x447;&#x435;&#x440;&#x435;&#x437; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x43A;&#x43E;&#x43B;&#x44B;, &#x430; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; HTTP. &#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x445; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432;, Wget &#x43F;&#x440;&#x435;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x432;&#x435;&#x431;-&#x430;&#x440;&#x445;&#x438;&#x432;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x439;&#x442;&#x438; &#x43F;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x443; &#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E;, &#x430;&#x432;&#x442;&#x43E;&#x43D;&#x43E;&#x43C;&#x43D;&#x443;&#x44E; &#x43A;&#x43E;&#x43F;&#x438;&#x44E; &#x43D;&#x430; &#x441;&#x432;&#x43E;&#x451;&#x43C; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x435;.</p><p>&#x414;&#x43B;&#x44F; Windows &#x43E;&#x43D;&#x430; <a href="http://gnuwin32.sourceforge.net/packages/wget.htm">&#x442;&#x43E;&#x436;&#x435; &#x435;&#x441;&#x442;&#x44C;</a>, &#x43D;&#x43E; &#x441;&#x430;&#x43C; &#x44F; &#x435;&#x451; &#x442;&#x430;&#x43C; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x43B;.</p><h3 id="wget">&#x41A;&#x430;&#x43A; &#x43C;&#x44B; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; wget</h3><p>&#x411;&#x443;&#x434;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43F;&#x43E; &#x432;&#x441;&#x435;&#x43C;&#x443; &#x43D;&#x430;&#x448;&#x435;&#x43C;&#x443; &#x441;&#x430;&#x439;&#x442;&#x443; &#x441;&#x43A;&#x430;&#x447;&#x438;&#x432;&#x430;&#x44F; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43E;&#x442;&#x434;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x43C; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x438; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x44F; &#x432;&#x441;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x44B; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x44B; &#x434;&#x43B;&#x44F; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; (&#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x44B; , &#x441;&#x442;&#x438;&#x43B;&#x438; &#x438; &#x442;.&#x43F;.) &#x432; &#x43F;&#x430;&#x43F;&#x43A;&#x443; &#x43D;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x435;.</p><p>&#x412;&#x43E;&#x442; &#x447;&#x442;&#x43E; &#x443; &#x43C;&#x435;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x43A;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x433;&#x43B;&#x430;&#x432;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B;: <img src="../content/images/2015/08/Screenshot.png" alt="Screenshot"></p><h3>&#x41F;&#x440;&#x438;&#x441;&#x442;&#x443;&#x43F;&#x430;&#x435;&#x43C;</h3><ul><li>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x43C; &#x441;&#x432;&#x43E;&#x439; &#x441;&#x430;&#x439;&#x442; &#x443; &#x441;&#x435;&#x431;&#x44F;.</li> <li>&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C; wget, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x43F;&#x438;&#x44E;. <code>wget -r -k -E -nH -Pstatic --restrict-file-name=unix http://localhost:2368/</code></li> <li>&#x417;&#x430;&#x433;&#x440;&#x443;&#x437;&#x438;&#x442;&#x44C; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B;&#x438; &#x43D;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x435;&#x43C; &#x448;&#x430;&#x433;&#x435; &#x43D;&#x430; &#x445;&#x43E;&#x441;&#x442;&#x438;&#x43D;&#x433;.</li></ul><hr><h4>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x43C; &#x441;&#x432;&#x43E;&#x439; &#x441;&#x430;&#x439;&#x442; &#x443; &#x441;&#x435;&#x431;&#x44F;.</h4><p>&#x42F; &#x437;&#x430;&#x445;&#x43E;&#x436;&#x443; &#x432; &#x43F;&#x430;&#x43F;&#x43A;&#x443; &#x441; Ghost &#x438; <code>npm start</code>. &#x415;&#x441;&#x43B;&#x438; &#x443; &#x432;&#x430;&#x441; Wordpress, &#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x43A;&#x430;&#x447;&#x430;&#x442;&#x44C; &#x441; <a href="https://bitnami.com/stack/wordpress">Bitnami &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x449;&#x438;&#x43A;</a> &#x438; &#x442;.&#x43F;.</p><pre><code class="language-bash">jiumx@jiumx-All-Series:~/src/ghost$ npm start

&gt; ghost@<span class="hljs-number">0.6</span>.<span class="hljs-number">4</span> start /home/jiumx/src/ghost
&gt; node index

Migrations: Up to date at version <span class="hljs-number">003</span>  
Ghost is running <span class="hljs-keyword">in</span> development...  
Listening on <span class="hljs-number">127.0</span>.<span class="hljs-number">0.1</span>:<span class="hljs-number">2368</span>  
Url configured as: http://localhost:<span class="hljs-number">2368</span>  
Ctrl+C to shut down
</code></pre><p>&#x41A;&#x430;&#x43A; &#x432;&#x438;&#x434;&#x438;&#x442;&#x435;, &#x43E;&#x43D; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43B;&#x441;&#x44F; &#x43D;&#x430; <code>localhost:2368</code> &#x438; &#x435;&#x441;&#x43B;&#x438; &#x43C;&#x44B; &#x43E;&#x442;&#x43A;&#x440;&#x43E;&#x435;&#x43C; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435; &#x44D;&#x442;&#x443; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x443;, &#x442;&#x43E; &#x442;&#x430;&#x43C; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x430;&#x448; &#x431;&#x43B;&#x43E;&#x433;. &#x41E;&#x43D; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x435;&#x43D; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441; &#x43D;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x430; &#x438; &#x43A;&#x430;&#x436;&#x434;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x443; &#x43E;&#x442; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;.</p><hr><h4 id="wget">&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C; wget, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x43F;&#x438;&#x44E;.</h4><p>&#x418; &#x442;&#x430;&#x43A; &#x43F;&#x440;&#x438;&#x441;&#x442;&#x443;&#x43F;&#x438;&#x43C; &#x43A; &#x440;&#x430;&#x437;&#x431;&#x43E;&#x440;&#x443; &#x44D;&#x442;&#x43E;&#x439; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x43E;&#x439; &#x438; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x439; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B; &#x432; &#x43F;&#x443;&#x43D;&#x43A;&#x442;&#x435; 2 :)</p><ol><li><code>wget</code> - &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x43C;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x44C;.</li> <li><code>-r</code> - &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43F;&#x43E; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x430;&#x43C; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430; &#x437;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43D;&#x430; &#x433;&#x43B;&#x430;&#x432;&#x43D;&#x443;&#x44E; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x441;&#x43A;&#x430;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442; &#x435;&#x451; &#x438; &#x432;&#x438;&#x434;&#x438;&#x442; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x443; &#x43D;&#x430; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439; &#x43F;&#x43E;&#x441;&#x442;, &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43A; &#x43F;&#x43E;&#x441;&#x442;&#x443;, &#x442;&#x430;&#x43C; &#x442;&#x43E;&#x436;&#x435; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x438; &#x43D;&#x430; &#x434;&#x440;&#x443;&#x433;&#x438;&#x435; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; &#x438; &#x432;&#x441;&#x435; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x44F;&#x435;&#x442;&#x441;&#x44F;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x43E;&#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x439;&#x434;&#x451;&#x442; &#x43F;&#x43E; &#x432;&#x441;&#x435;&#x43C;&#x443; &#x441;&#x430;&#x439;&#x442;&#x443;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x435;&#x43D; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44E;.</li> <li><code>-k</code> - &#x43F;&#x440;&#x435;&#x432;&#x440;&#x430;&#x442;&#x438;&#x442;&#x44C; &#x430;&#x431;&#x441;&#x43E;&#x43B;&#x44E;&#x442;&#x43D;&#x44B;&#x435; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x438; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x435; &#x432; &#x43E;&#x442;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x438;. &#x422;&#x43E; &#x435;&#x441;&#x442;&#x44C; <code>grishy.ru/post-simple</code> &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x430;&#x43D; &#x432; <code>post-simple</code>. &#x42D;&#x442;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x441;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x430;&#x44F; &#x43A;&#x43E;&#x43F;&#x438;&#x44F; &#x43D;&#x435; &#x437;&#x430;&#x432;&#x438;&#x441;&#x435;&#x43B;&#x430; &#x43E;&#x442; &#x438;&#x43C;&#x435;&#x43D;&#x438; &#x441;&#x430;&#x439;&#x442;&#x430; &#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43B;&#x430; &#x432; &#x43B;&#x44E;&#x431;&#x43E;&#x439; &#x43F;&#x430;&#x43F;&#x43A;&#x435;.</li> <li><code>-E</code> - &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x435; <code>.html</code> &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430;&#x43C;. &#x41D;&#x443;&#x436;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x430;.</li> <li><code>-nH</code> - &#x41E;&#x442;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x435;&#x442; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435; &#x445;&#x43E;&#x441;&#x442;-&#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433;&#x430;. &#x41F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44F; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A; wget &#x441;&#x43E;&#x437;&#x434;&#x430;&#x441;&#x442; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443; &#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433;&#x43E;&#x432;, &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44F; &#x441; localhost:2368.</li> <li><code>-Pstatic</code> - &#x41E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442; &#x432; &#x43A;&#x430;&#x43A;&#x443;&#x44E; &#x43F;&#x430;&#x43F;&#x43A;&#x443; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x442;&#x44C; &#x441;&#x430;&#x439;&#x442;. &#x412; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x43D;&#x430; &#x43F;&#x430;&#x43F;&#x43A;&#x430; <em>static</em>. &#x418;&#x43D;&#x430;&#x447;&#x435; &#x432;&#x441;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x44B; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x44B;&#x432;&#x430;&#x43B;&#x44F;&#x442;&#x441;&#x44F; &#x432; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x438;&#x44E;, &#x43E;&#x442;&#x43A;&#x443;&#x434;&#x430; &#x431;&#x44B;&#x43B;&#x430; &#x437;&#x430;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430;.</li> <li><code>--restrict-file-name=unix</code> - &#x41E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x431;&#x43E;&#x440; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x432;, &#x440;&#x430;&#x437;&#x440;&#x435;&#x448;&#x451;&#x43D;&#x43D;&#x44B;&#x445; &#x432; URL. &#x41F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E; wget &#x44D;&#x43A;&#x440;&#x430;&#x43D;&#x438;&#x440;&#x443;&#x435;&#x442; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E; &#x438;&#x43C;&#x435;&#x43D;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x432; &#x432;&#x430;&#x448;&#x435;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x435;, &#x430; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x449;&#x438;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44B;, &#x43A;&#x430;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43E; &#x43D;&#x435;&#x43F;&#x435;&#x447;&#x430;&#x442;&#x43D;&#x44B;&#x435;. &#x418;&#x43D;&#x430;&#x447;&#x435; &#x443; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x43F;&#x43E;&#x44F;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x432;&#x435;&#x441;&#x451;&#x43B;&#x44B;&#x435; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x442;&#x438;&#x43F;&#x430; <code>/\321%81&#x43A;&#x430;\321%87&#x430;\321%82\321%8C</code></li> <li><code>http://localhost:2368/</code> - URL &#x43D;&#x430; &#x441;&#x430;&#x439;&#x442; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43F;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; URL &#x43D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43D;&#x430; &#x441;&#x432;&#x43E;&#x451;&#x43C; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x435;, &#x430; &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x43D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x43E;&#x439; &#x441;&#x430;&#x439;&#x442; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x438; :)</li></ol><p>&#x422;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x43C;&#x44B; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x43C; &#x432; &#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x430;&#x445; &#x441;&#x432;&#x43E;&#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x430;, &#x442;&#x43E; &#x43A;&#x43E;&#x43F;&#x438;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E;. &#x41D;&#x430;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E;?</p><pre><code class="language-bash">&#x417;&#x410;&#x412;&#x415;&#x420;&#x428;&#x415;&#x41D;&#x41E; --<span class="hljs-number">2015</span>-<span class="hljs-number">08</span>-<span class="hljs-number">21</span> <span class="hljs-number">00</span>:<span class="hljs-number">16</span>:<span class="hljs-number">50</span>--
&#x41E;&#x431;&#x449;&#x435;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F;: <span class="hljs-number">1</span>,<span class="hljs-number">0</span>s
&#x417;&#x430;&#x433;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x43E;: <span class="hljs-number">33</span> &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;, <span class="hljs-number">5</span>,<span class="hljs-number">1</span>M &#x437;&#x430; <span class="hljs-number">0</span>,<span class="hljs-number">7</span>s (<span class="hljs-number">7</span>,<span class="hljs-number">24</span> MB/s)
</code></pre><p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430; &#x438; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x44B; &#x443; &#x43D;&#x430;&#x441; &#x431;&#x443;&#x434;&#x435;&#x442; &#x430;&#x43A;&#x43A;&#x443;&#x440;&#x430;&#x442;&#x43D;&#x430;&#x44F; &#x43F;&#x430;&#x43F;&#x43E;&#x447;&#x43A;&#x430; static &#x441; &#x441;&#x430;&#x439;&#x442;&#x43E;&#x43C;.</p><pre><code class="language-bash">jiumx@jiumx-All-Series:~/src/blog$ tree . <span class="hljs-operator">-d</span>  
.
&#x2514;&#x2500;&#x2500; statis
    &#x251C;&#x2500;&#x2500; about
    &#x251C;&#x2500;&#x2500; assets
    &#x2502;&#xA0;&#xA0; &#x251C;&#x2500;&#x2500; css
    &#x2502;&#xA0;&#xA0; &#x251C;&#x2500;&#x2500; fonts
    &#x2502;&#xA0;&#xA0; &#x251C;&#x2500;&#x2500; images
    &#x2502;&#xA0;&#xA0; &#x2514;&#x2500;&#x2500; js
    &#x251C;&#x2500;&#x2500; content
    &#x2502;&#xA0;&#xA0; &#x2514;&#x2500;&#x2500; images
    &#x2502;&#xA0;&#xA0;     &#x2514;&#x2500;&#x2500; <span class="hljs-number">2015</span>
    &#x2502;&#xA0;&#xA0;         &#x2514;&#x2500;&#x2500; <span class="hljs-number">08</span>
    &#x251C;&#x2500;&#x2500; gienieratsiia-statichieskogho-saita-liubogho-saita
    &#x251C;&#x2500;&#x2500; pochiemu-ghost
    &#x251C;&#x2500;&#x2500; projects
    &#x251C;&#x2500;&#x2500; rss
    &#x2514;&#x2500;&#x2500; tag
        &#x251C;&#x2500;&#x2500; ghost-tag
        &#x251C;&#x2500;&#x2500; git
        &#x251C;&#x2500;&#x2500; node-js
        &#x251C;&#x2500;&#x2500; optimizatsiia
        &#x251C;&#x2500;&#x2500; wget
        &#x2514;&#x2500;&#x2500; wordpress

<span class="hljs-number">22</span> directories  
</code></pre><hr><h4 id="github">&#x417;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x435;&#x43C; &#x43D;&#x430; GitHub</h4><p>&#x418; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x43D;&#x430;&#x448; &#x431;&#x43B;&#x43E;&#x433; &#x432;&#x441;&#x435;&#x43C;. &#x42F; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x44D;&#x442;&#x438;&#x43C; &#x435;&#x449;&#x451; &#x435;&#x433;&#x43E; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x438;&#x440;&#x443;&#x44E;, &#x43D;&#x43E; &#x44D;&#x442;&#x43E; &#x43D;&#x435; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; :). &#x420;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x438;&#x440;&#x443;&#x435;&#x43C;&#x441;&#x44F; &#x43D;&#x430; GitHub &#x438; &#x437;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x43C; <a href="https://pages.github.com/">GitHub Pages</a>. &#x412;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x43C; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439; &#x43F;&#x443;&#x43D;&#x43A;&#x442; &#x442;.&#x435;. &#x441;&#x43E;&#x437;&#x434;&#x430;&#x439;&#x442;&#x435; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x439; c &#x438;&#x43C;&#x435;&#x43D;&#x435;&#x43C; <code>username.github.io</code>, &#x433;&#x434;&#x435; <em>username</em> &#x44D;&#x442;&#x43E; &#x43D;&#x438;&#x43A; &#x43D;&#x430; GitHub. &#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x44F; &#x43E;&#x442;&#x43A;&#x440;&#x43E;&#x435;&#x442;&#x441;&#x44F; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435;&#x435; &#x43D;&#x430; <img src="../content/images/2015/08/Screenshot-2.png" alt="Screenshot git"></p><p>&#x412; &#x43F;&#x430;&#x43F;&#x43A;&#x435; <code>statis</code> &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x43C; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B;(<a href="https://git-scm.com/book/ru/v1/%D0%9E%D1%81%D0%BD%D0%BE%D0%B2%D1%8B-Git-%D0%97%D0%B0%D0%BF%D0%B8%D1%81%D1%8C-%D0%B8%D0%B7%D0%BC%D0%B5%D0%BD%D0%B5%D0%BD%D0%B8%D0%B9-%D0%B2-%D1%80%D0%B5%D0%BF%D0%BE%D0%B7%D0%B8%D1%82%D0%BE%D1%80%D0%B8%D0%B9">&#x41A;&#x440;&#x430;&#x442;&#x43A;&#x43E; &#x43E; git, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x442;&#x44C; &#x447;&#x442;&#x43E; &#x43A; &#x447;&#x435;&#x43C;&#x443;</a>)</p><ul><li><code>git init</code> - &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x44F;</li> <li><code>git add .</code> - &#x432;&#x44B;&#x431;&#x440;&#x430;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x44B; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438; &#x43D;&#x430; github</li> <li><code>git commit -m &quot;&#x41E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x431;&#x43B;&#x43E;&#x433;&#x430;&quot;</code> - &#x441;&#x43E;&#x437;&#x434;&#x430;&#x435;&#x43C; &#x43A;&#x43E;&#x43C;&#x43C;&#x438;&#x442; &#x441; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x44C;&#x44E; <em>&#x41E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x431;&#x43B;&#x43E;&#x433;&#x430;</em>. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43B;&#x44E;&#x431;&#x43E;&#x435; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435;. &#x423; &#x43C;&#x435;&#x43D;&#x44F; &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x441; &#x434;&#x430;&#x442;&#x43E;&#x439; &#x435;&#x433;&#x43E; &#x43E;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x2193; <img src="../content/images/2015/08/Screenshot-3.png" alt="&#x421;&#x43A;&#x440;&#x438;&#x43D;&#x448;&#x43E;&#x442; &#x43A;&#x43E;&#x43C;&#x43C;&#x438;&#x442;&#x430; "></li> <li>&#x410; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43D;&#x430;&#x434;&#x43E; &#x432;&#x432;&#x435;&#x441;&#x442;&#x438; &#x442;&#x435; &#x442;&#x435; &#x434;&#x432;&#x435; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x44F; &#x43E;&#x431;&#x432;&#x451;&#x43B; &#x43D;&#x430; &#x441;&#x43A;&#x440;&#x438;&#x43D;&#x448;&#x43E;&#x442;&#x435; &#x432;&#x44B;&#x448;&#x435; (<span style="color:red"><strong>&#x43A;&#x440;&#x430;&#x441;&#x43D;&#x44B;&#x43C;</strong></span>). &#x41F;&#x435;&#x440;&#x432;&#x430;&#x44F; &#x443;&#x43A;&#x430;&#x436;&#x435;&#x442; &#x43A;&#x443;&#x434;&#x430; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C;, &#x430; &#x432;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442; &#x435;&#x433;&#x43E;.</li></ul><p>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x441;&#x435; &#x43F;&#x440;&#x43E;&#x448;&#x43B;&#x43E; &#x431;&#x435;&#x437; &#x43E;&#x448;&#x438;&#x431;&#x43E;&#x43A;, &#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x438;&#x43C; &#x43D;&#x430; <code>username.github.io</code> &#x438; &#x43D;&#x430;&#x441;&#x43B;&#x430;&#x436;&#x434;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x430;&#x439;&#x442;&#x43E;&#x43C;. &#x41A; &#x441;&#x43B;&#x43E;&#x432;&#x443; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43D;&#x435; &#x43C;&#x433;&#x43D;&#x43E;&#x432;&#x435;&#x43D;&#x43D;&#x43E;. &#x410; &#x432; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x438; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x435;&#x441;&#x442;&#x44C; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x44F; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430; &#x438; &#x438; &#x43F;&#x440;&#x438; &#x436;&#x435;&#x43B;&#x430;&#x43D;&#x438;&#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43E;&#x442;&#x43A;&#x430;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43D;&#x435;&#x434;&#x435;&#x43B;&#x44E; &#x43D;&#x430;&#x437;&#x430;&#x434;, &#x435;&#x441;&#x43B;&#x438; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x43D;&#x435; &#x43F;&#x43E;&#x43D;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43E;&#x441;&#x44C; &#x438;&#x43B;&#x438; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x43A;&#x430;&#x43A; &#x43E;&#x43D; &#x440;&#x430;&#x437;&#x432;&#x438;&#x432;&#x430;&#x43B;&#x441;&#x44F;.</p><p></p><center><iframe width="853" height="480" src="https://www.youtube.com/embed/insM7oUYNOE?rel=0" frameborder="0" allowfullscreen></iframe></center></div><div class="post-tags"><i class="fa fa-tags"></i>&#x422;&#x435;&#x433;&#x438;: <a href="../tag/node-js/">Node.js</a>, <a href="../tag/ghost-tag/">Ghost</a>, <a href="../tag/wget/">Wget</a>, <a href="../tag/git/">Git</a></div><div class="post-comments"><button class="button"><i class="fa fa-comments"></i> &#x41F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;/&#x41D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x438;</button><div id="disqus_thread"></div></div></div></article></div></div></div></div><footer id="copyright"><div class="container"><div class="row"><div class="col-sm-12 col-md-6"><div class="copyright-text">&#xA9; <a href="../">Grishy.ru</a> 2015 &#x2022; All rights reserved.</div></div><div class="col-sm-12 col-md-6"><div class="social-profiles"><a href="http://vk.com/unbiby" target="_blank"><i class="fa fa-vk"></i></a> <a href="http://www.youtube.com/channel/UCs-BYKmVPdBPCXOC0LFZfCg" target="_blank"><i class="fa fa-youtube"></i></a> <a href="https://twitter.com/unbiby" target="_blank"><i class="fa fa-twitter"></i></a> <a href="mailto:mail@grishy.ru" target="_blank"><i class="fa fa-envelope-o"></i></a> <a href="../rss/index.rss" target="_blank"><i class="fa fa-rss"></i></a></div></div></div></div></footer><script src="../bundle-1035.js" async></script></body>