<head><meta charset="utf-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><title>&#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430; &#x438;&#x437; &#x43B;&#x44E;&#x431;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430;</title><meta name="description" content=""><meta name="HandheldFriendly" content="True"><meta name="viewport" content="width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no"><link rel="shortcut icon" href="../assets/favicon.png?v=bb5b63421c"><link rel="stylesheet" href="../bundle-975.css"><link rel="alternate" type="application/rss+xml" title="Grishy.ru" href="../rss/index.html"></head><body><header id="header" class="light normal"><div class="container"><h2 class="logo"><a href="../" title="Grishy.ru">Grishy.ru</a></h2><p>&#x411;&#x43B;&#x43E;&#x433; &#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438;</p><div class="primary-menu"><div class="logo-fixed"><a href="../" title="Grishy.ru">Grishy.ru</a></div><ul id="primary-menu" class="menu"><li role="presentation"><a href="../">&#x413;&#x43B;&#x430;&#x432;&#x43D;&#x430;&#x44F;</a></li> <li role="presentation"><a href="../projects/">&#x41F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B;</a></li> <li role="presentation"><a href="../about/">&#x41E; &#x441;&#x430;&#x439;&#x442;&#x435;</a></li></ul></div><div class="social-profiles"><a href="http://vk.com/unbiby" target="_blank"><i class="fa fa-vk"></i></a> <a href="http://www.youtube.com/channel/UCs-BYKmVPdBPCXOC0LFZfCg" target="_blank"><i class="fa fa-youtube"></i></a> <a href="https://twitter.com/unbiby" target="_blank"><i class="fa fa-twitter"></i></a> <a href="mailto:mail@grishy.ru" target="_blank"><i class="fa fa-envelope-o"></i></a> <a href="../rss/index.rss" target="_blank"><i class="fa fa-rss"></i></a></div><a href="index.html#" class="menu-mobile-open"><i class="fa fa-bars"></i></a></div></header><div id="menu-mobile" style="display:none"><div class="inner"><a href="index.html#" class="menu-mobile-close"><i class="fa fa-close"></i></a><ul id="mobile-menu" class="menu"> <li role="presentation"><a href="../">&#x413;&#x43B;&#x430;&#x432;&#x43D;&#x430;&#x44F;</a></li> <li role="presentation"><a href="../projects/">&#x41F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B;</a></li> <li role="presentation"><a href="../about/">&#x41E; &#x441;&#x430;&#x439;&#x442;&#x435;</a></li></ul></div></div><div id="page-content"><div class="container"><div class="row"><div class="col-md-12"><article class="post"><div class="featured-image"><a href="index.html"><img src="../content/images/2015/08/wget.jpg" rel="image_src" alt="&#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430; &#x438;&#x437; &#x43B;&#x44E;&#x431;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430;"></a></div><div class="post-content"><h2 class="post-title"><a href="index.html">&#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430; &#x438;&#x437; &#x43B;&#x44E;&#x431;&#x43E;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430;</a></h2><time class="post-date" datetime="2015-08-19"><i class="fa fa-clock-o"></i>19 &#x410;&#x432;&#x433;&#x443;&#x441;&#x442;&#x430; 2015 &#x433;.</time><div class="post-text"><p>&#x421;&#x435;&#x439;&#x447;&#x430;&#x441; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x43C; &#x43A;&#x430;&#x43A; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x443;&#x44E;(&#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E;) &#x43A;&#x43E;&#x43F;&#x438;&#x44E; &#x441;&#x430;&#x439;&#x442;&#x430;, &#x435;&#x441;&#x43B;&#x438; &#x443; &#x43D;&#x435;&#x433;&#x43E; &#x43D;&#x435;&#x442; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x432; CMS &#x438; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x43D;&#x430; <a href="https://pages.github.com/">GitHub Pages</a>. &#x41A; &#x441;&#x43B;&#x43E;&#x432;&#x443;, &#x435;&#x441;&#x43B;&#x438; &#x43D;&#x443;&#x436;&#x435;&#x43D; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x441;&#x430;&#x439;&#x442;, &#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x43F;&#x440;&#x43E;&#x431;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x432; GitHub <a href="https://github.com/jekyll/jekyll">Jekyll</a> &#x438; &#x435;&#x441;&#x43B;&#x438; &#x443; &#x432;&#x430;&#x441; &#x431;&#x43B;&#x43E;&#x433; &#x438; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x43D;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x430;&#x441;&#x44C; &#x438;&#x434;&#x435;&#x44F; Jekyll, &#x43F;&#x43E;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x439;&#x442;&#x435; <a href="http://octopress.org/">Octopress</a>. &#x42F; &#x442;&#x430;&#x43A; &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x44E; &#x44D;&#x442;&#x43E;&#x442; &#x431;&#x43B;&#x43E;&#x433; &#x43D;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x449;&#x438;&#x439; &#x43D;&#x430; Ghost.</p><p>&#x41B;&#x435;&#x433;&#x447;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x43A;&#x430;&#x447;&#x430;&#x432; &#x432;&#x441;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x431;&#x43B;&#x43E;&#x433; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;. &#x413;&#x440;&#x443;&#x431;&#x43E; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x44F; &#x437;&#x430;&#x439;&#x434;&#x44F; &#x43D;&#x430; &#x432;&#x441;&#x435; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; &#x441;&#x430;&#x439;&#x442;&#x430; &#x438; &#x43D;&#x430;&#x436;&#x430;&#x442;&#x44C; <code>Ctrl+S</code>. &#x41F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x44B; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x439; &#x432; Linux &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x43E;&#x439; <a href="https://ru.wikipedia.org/wiki/Wget">wget</a> &#x438; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x441;&#x435; &#x44D;&#x442;&#x43E; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x439;.</p><h3 id="wget">&#x427;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x435; wget?</h3><p><a href="https://ru.wikipedia.org/wiki/Wget"><strong>Wget</strong></a> &#x2014; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x43D;&#x430;&#x44F; &#x43D;&#x435;&#x438;&#x43D;&#x442;&#x435;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x430;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432; &#x43F;&#x43E; &#x441;&#x435;&#x442;&#x438;. &#x41F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x43A;&#x43E;&#x43B;&#x44B; <em>HTTP</em>, <em>FTP</em> &#x438; <em>HTTPS</em>, &#x430; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x443; &#x447;&#x435;&#x440;&#x435;&#x437; <em>HTTP</em> &#x43F;&#x440;&#x43E;&#x43A;&#x441;&#x438;-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440;. &#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x432;&#x43E; &#x432;&#x441;&#x435; &#x434;&#x438;&#x441;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x438;&#x432;&#x44B; <em>GNU/Linux</em>. &#xA9; Wikipedia</p><p>Wget &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x43E;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x43A;&#x430;&#x447;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432; &#x447;&#x435;&#x440;&#x435;&#x437; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x43A;&#x43E;&#x43B;&#x44B;, &#x430; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; HTTP. &#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x445; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432;, Wget &#x43F;&#x440;&#x435;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x432;&#x435;&#x431;-&#x430;&#x440;&#x445;&#x438;&#x432;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x439;&#x442;&#x438; &#x43F;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x443; &#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E;, &#x430;&#x432;&#x442;&#x43E;&#x43D;&#x43E;&#x43C;&#x43D;&#x443;&#x44E; &#x43A;&#x43E;&#x43F;&#x438;&#x44E; &#x43D;&#x430; &#x441;&#x432;&#x43E;&#x451;&#x43C; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x435;.</p><h3 id="wget">&#x41A;&#x430;&#x43A; &#x43C;&#x44B; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; wget</h3><p>&#x411;&#x443;&#x434;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43F;&#x43E; &#x432;&#x441;&#x435;&#x43C;&#x443; &#x43D;&#x430;&#x448;&#x435;&#x43C;&#x443; &#x441;&#x430;&#x439;&#x442;&#x443; &#x441;&#x43A;&#x430;&#x447;&#x438;&#x432;&#x430;&#x44F; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43E;&#x442;&#x434;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x43C; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x438; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x44F; &#x432;&#x441;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x44B; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x44B; &#x434;&#x43B;&#x44F; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; (&#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x44B; , &#x441;&#x442;&#x438;&#x43B;&#x438; &#x438; &#x442;.&#x43F;.) &#x432; &#x43F;&#x430;&#x43F;&#x43A;&#x443; &#x43D;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x435;.</p><p>&#x414;&#x43B;&#x44F; Windows &#x43E;&#x43D;&#x430; <a href="http://gnuwin32.sourceforge.net/packages/wget.htm">&#x442;&#x43E;&#x436;&#x435; &#x435;&#x441;&#x442;&#x44C;</a>, &#x43D;&#x43E; &#x441;&#x430;&#x43C; &#x44F; &#x435;&#x451; &#x442;&#x430;&#x43C; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x43B;.</p></div><div class="post-tags"><i class="fa fa-tags"></i>&#x422;&#x435;&#x433;&#x438;: <a href="../tag/node-js/">Node.js</a>, <a href="../tag/wget/">Wget</a>, <a href="../tag/git/">Git</a></div><div class="post-comments"><button class="button"><i class="fa fa-comments"></i> &#x41F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;/&#x41D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x438;</button><div id="disqus_thread"></div></div></div></article></div></div></div></div><footer id="copyright"><div class="container"><div class="row"><div class="col-sm-12 col-md-6"><div class="copyright-text">&#xA9; <a href="../">Grishy.ru</a> 2015 &#x2022; All rights reserved.</div></div><div class="col-sm-12 col-md-6"><div class="social-profiles"><a href="http://vk.com/unbiby" target="_blank"><i class="fa fa-vk"></i></a> <a href="http://www.youtube.com/channel/UCs-BYKmVPdBPCXOC0LFZfCg" target="_blank"><i class="fa fa-youtube"></i></a> <a href="https://twitter.com/unbiby" target="_blank"><i class="fa fa-twitter"></i></a> <a href="mailto:mail@grishy.ru" target="_blank"><i class="fa fa-envelope-o"></i></a> <a href="../rss/index.rss" target="_blank"><i class="fa fa-rss"></i></a></div></div></div></div></footer><script src="../bundle-998.js" async></script></body>